"use client";

import React, { useState } from "react";

import "./News.scss";
import Image from "next/image";
import Pagination from "@/components/ui/PaginationComponent";
import Link from "next/link";
import { Locale } from "@/i18n.config";
const categories = [
  {
    id: 1,
    image: "/images/category/categoryItem1.png",
    name: "За перше місце – 20 тисяч євро: У Львові назвали переможців конкурсу скрипалів",
    link: "https://galnet.fm/za-pershe-mistse-20-tysyach-yevro-u-lvovi-nazvaly-peremozhtsiv-konkursu-skrypaliv/",
    date: "12 мая 2020",
    text: "ю Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 2,
    image: "/images/category/categoryItem2.png",
    name: "Футляры и чехлы для струнных инструментов",
    date: "12 мая 2020",
    link: "",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 3,
    image: "/images/category/categoryItem3.png",
    name: "Аксессуары для струнных инструментов",
    date: "12 мая 2020",
    link: "",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 4,
    image: "/images/category/categoryItem4.png",
    name: "Струны",
    link: "https://galnet.fm/za-pershe-mistse-20-tysyach-yevro-u-lvovi-nazvaly-peremozhtsiv-konkursu-skrypaliv/",
    date: "12 мая 2020",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 5,
    image: "/images/category/categoryItem5.png",
    link: "",
    name: "Инструменты и материалы для скрипичных и гитарных мастеров",
    date: "12 мая 2020",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 6,
    link: "",
    image: "/images/category/categoryItem6.png",
    name: "Аксессуары для духовых инструментов",
    date: "12 мая 2020",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 7,
    image: "/images/category/categoryItem7.png",
    name: "Деревянные духовые инструменты",
    link: "https://galnet.fm/za-pershe-mistse-20-tysyach-yevro-u-lvovi-nazvaly-peremozhtsiv-konkursu-skrypaliv/",
    date: "12 мая 2020",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 8,
    image: "/images/category/categoryItem8.png",
    name: "Медные духовые инструменты",
    date: "12 мая 2020",
    link: "",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 9,
    image: "/images/category/categoryItem9.png",
    name: "Футляры и чехлы для духовых инструментов",
    date: "12 мая 2020",
    link: "",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 10,
    image: "/images/category/categoryItem10.png",
    name: "Футляры и чехлы для гитар",
    date: "12 мая 2020",
    link: "",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 11,
    image: "/images/category/categoryItem11.png",
    name: "Пюпитры, стойки и прочие аксессуары",
    date: "12 мая 2020",
    link: "",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 12,
    image: "/images/category/categoryItem12.png",
    name: "Канцелярия и сувениры",
    date: "12 мая 2020",
    link: "",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 13,
    image: "/images/category/categoryItem13.png",
    name: "Музыкальная литература, ноты",
    date: "12 мая 2020",
    link: "",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
  {
    id: 14,
    image: "/images/category/categoryItem14.png",
    name: "Ремонт музыкальных инструментов, экспертная оценка",
    date: "12 мая 2020",
    link: "",
    text: "Знаменитий український скрипаль Олег Криса (учень педагога Костянтина Михайлова і легендарного професора Давида Ойстраха) вже більше як півстоліття захоплює і дивує своєю виконавською майстерністю світову музичну спільноту. Напрочуд грандіозний його репертуарний доробок охоплює скрипкові шедеври старовинної італійської спадщини, епохи бароко, віденських класиків, композиторів-романтиків, найяскравіші зразки музики ХХ сторіччя та найбільш знакові твори",
  },
];
export default function Page({
  params: { lang },
}: {
  params: { lang: Locale };
}) {
  const [currentPage, setCurrentPage] = useState(1);
  const [itemsPerPage, setItemsPerPage] = useState(6);
  const [totalItems, setTotalItems] = useState(categories.length);

  const totalPages = Math.ceil(totalItems / itemsPerPage);
  const indexOfLastItem = currentPage * itemsPerPage;
  const indexOfFirstItem = indexOfLastItem - itemsPerPage;

  return (
    <div className="newsPage">
      <div className="newsPage__grid">
        {categories
          .slice(indexOfFirstItem, indexOfLastItem)
          .map((category, i) => (
            <div className="newsPage__grid--item" key={category.id}>
              <Link
                href={`/${lang}/news/${category.id}`}
                className="newsPage__grid--item-link"
              >
                <div className="newsPage--image">
                  <Image src={category.image} alt="text" fill />
                </div>
              </Link>
              <div className="newsPage__item--event">
                <Link
                  href={`/news/${category.id}`}
                  className="event__titleLink"
                >
                  {category.name}
                </Link>
                <p className="event__date">{category.date}</p>
                {category.link && (
                  <Link href={category.link} className="event__extaLink">
                    Переглянути на {new URL(category.link).hostname}
                  </Link>
                )}
                <p className="event__description">
                  {category.text.length > 350
                    ? `${category.text.slice(0, 350)}...`
                    : category.text}
                </p>
              </div>
            </div>
          ))}
      </div>
      <Pagination
        onCurrentPage={setCurrentPage}
        onItemsPerPage={setItemsPerPage}
        onTotalItems={setTotalItems}
        totalItems={totalItems}
        itemsPerPage={itemsPerPage}
        currentPage={currentPage}
        totalPages={totalPages}
      />
    </div>
  );
}
